TamPhuc2/STM32_Project/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_RED_1_Pin GPIO_PIN_13
#define LED_RED_1_GPIO_Port GPIOC
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define GATE_A_Pin GPIO_PIN_6
#define GATE_A_GPIO_Port GPIOA
#define GATE_B_Pin GPIO_PIN_7
#define GATE_B_GPIO_Port GPIOA
#define GATE_C_Pin GPIO_PIN_8
#define GATE_C_GPIO_Port GPIOA
#define GATE_D_Pin GPIO_PIN_9
#define GATE_D_GPIO_Port GPIOA
#define GATE_E_Pin GPIO_PIN_10
#define GATE_E_GPIO_Port GPIOA
#define GATE_F_Pin GPIO_PIN_11
#define GATE_F_GPIO_Port GPIOA
#define GATE_G_Pin GPIO_PIN_12
#define GATE_G_GPIO_Port GPIOA
#define SDI_Pin GPIO_PIN_3
#define SDI_GPIO_Port GPIOB
#define SCLK_Pin GPIO_PIN_4
#define SCLK_GPIO_Port GPIOB
#define LOAD_Pin GPIO_PIN_5
#define LOAD_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
